USE WebStor1;

/*
Завдання 1
Напишіть запит, який поверне список унікальних ідентифікаторів виробників товару (MFR).
Враховуйте лише замовлення, які були проведені у 2008 році клієнтами зі словом CORP у назві (COMPANY). 
Для цього необхідно використовувати оператор LIKE та підстановочні знаки (wildcards).
- Використовуються таблиці: dbo.CUSTOMERS, dbo.ORDERS
- Застосуйте внутрішнє з'єднання (ANSI-92)
- Результуючий набір даних містить: Ідентифікатор виробника товару (без дублікатів)
*/
SELECT DISTINCT MFR
FROM [dbo].[CUSTOMERS]
INNER JOIN ORDERS ON [CUST_REP] = [REP]
WHERE [ORDER_DATE] BETWEEN '2008-01-01' AND '2009-01-01'
AND COMPANY LIKE '%CORP%';
GO

/*
Напишіть запит, який у розрізі ідентифікатора клієнта (CUST_NUM) та місяця проведення замовлення 
(ORDER_DATE) поверне кількість унікальних замовлень (для цього використовується GROUP BY). 
Враховуйте лише замовлення, які були проведені у 2008 році клієнтами зі словом CORP. у назві (COMPANY).
У випадку, якщо у клієнта не було жодного замовлення, залиште такого клієнта у результуючому наборі даних.
Відсортуйте результативний набір даних за кількістю проведених замовлень (за спаданням)
- Використовуються таблиці: dbo.CUSTOMERS, dbo.ORDERS
- Застосуйте ліве зовнішнє з'єднання
- Результуючий набір даних містить: ідентифікатор клієнта, місяць проведення замовлення
(для отримання місяця з дати замовлення використовуємо функцію MONTH), кількість унікальних замовлень (використовуємо COUNT)
*/
SELECT CUST_NUM, MONTH(ORDER_DATE) AS Місяць_замовлення, COUNT (DISTINCT ORDER_NUM) AS Кількість_Унікальних_Замовлень 
FROM [dbo].[CUSTOMERS]
LEFT OUTER JOIN ORDERS ON CUST_NUM = CUST
WHERE [ORDER_DATE] BETWEEN '2008-01-01' AND '2009-01-01'
AND COMPANY LIKE '%CORP%'
GROUP BY CUST_NUM, MONTH(ORDER_DATE)
ORDER BY Кількість_Унікальних_Замовлень DESC;
GO

/*
Напишіть запит, який поверне список (без дублікатів) придбаних товарів.
Враховуйте лише замовлення, які були проведені у 2008 році клієнтами зі словом CORP у назві (COMPANY).
У випадку, якщо у клієнта не було жодного замовлення, залиште такого клієнта у результуючому наборі даних.
- Використовуються таблиці: dbo.CUSTOMERS, dbo.ORDERS, dbo.PRODUCTS
- Застосуйте ліве зовнішнє з'єднання
- Результуючий набір даних містить: Ідентифікатор клієнта, назва компанії (у верхньому регістрі.
Для цього використовуємо рядкову функцію (String Function) UPPER), опис товару ([DESCRIPTION])
*/
SELECT DISTINCT [CUST_NUM], UPPER([COMPANY]) AS Назва_Компанії, [DESCRIPTION] 
FROM [dbo].[CUSTOMERS]
LEFT OUTER JOIN [ORDERS] ON [CUST_NUM] = [CUST]
LEFT OUTER JOIN [PRODUCTS] ON [PRODUCT_ID] = [PRODUCT]
WHERE [ORDER_DATE] BETWEEN '2008-01-01' AND '2009-01-01'
AND [COMPANY] LIKE '%CORP%';
GO